#include <stdio.h>
int main()
{
    float a = 123456.555;
    printf("%5.5f\n", a);
    printf("%.*f\n",5,a);

    printf("%5d\n", 1000);  //默认右对齐,左边补空格
    printf("%-5d\n", 1000); //左对齐,右边补空格

    printf("%+d %+d\n", 1000, -1000); //输出正负号
    printf("% d % d\n", 1000, -1000); //正号用空格替代，负号输出

    //#	井号	type是o、x、X时，增加前缀0、0x、0X。
    //type是a、A、e、E、f、g、G时，一定使用小数点。默认的，如果使用.0控制不输出小数部分，则不输出小数点。
    //type是g、G时，尾部的0保留。
    printf("%x %#x\n", 1000, 1000); //输出0x
    printf("%.0f %#.0f\n", 1000.0, 1000.0); //当小数点后不输出值时依然输出小数点
    printf("%g %#g\n", 1000.0, 1000.0); //保留小数点后后的0
    printf("%05d\n", 1000); //前面补0
    return 0;
}