#include<stdio.h>
#include<math.h>
int main(){
	int n1,n2;//输入数据n1,n2 
	scanf("%d %d",&n1,&n2);
	if((n1>0&&n2<0)||(n1<0&&n2>0)){
    	printf("-");
	}
	
	if(n1==0||n2==0){
		printf("0");
	}
	
	else{
		int a[64]={0}; //数组a，用于存n1转化为二进制后的原码 
		int b[64]={0};//数组b，用来存n2转化为二进制后的原码 
		int c[64]={0};//数组c，用来存n1*n2转化为二进制的原码 
		
		n1=abs(n1);
		n2=abs(n2);
	
	    int num1=0,num2=0; /*num1，num2用来计算n1，n2，转化为二进制后的码位，如4二进制：100，对应码位：3 （PS:这里的“码位”是笔者自己编的，不要混淆了）*/
	    
		while(n1>0||n2>0){
			if(n1>0){
			if(n1%2!=0){
				a[num1]=1;
			}
			n1=n1>>1;
			num1++;
		}
			if(n2>0){
			if(n2%2!=0){
				b[num2]=1;
			}
			n2=n2>>1;
			num2++;
		}
	}
	
		int i,i2,j;   //循环变量 
		int k;     //c数组的指针 
		
		    for(int i=0;i<num1;i++){
			    k=i;
		    	for(int j=0;j<num2;j++){	
		    		c[k]=c[k]+(a[i]&b[j]);
		    		if(c[k]>1){
		    			c[k]=c[k]%2;        //用数组进行乘运算 
		    			c[k+1]++;
					}
					k++;
				}
			}
			
		
		/*c数组在计算中有可能会进位，例如：a:（11111）2*b:（111）2 a码位：5，b码位：3 若结果未进位，结果码位应为：5+2=7 对应数组中：0~6
		                                  但是，结果进位了，11111
										                   11111
										                  1011101
										                  11111
										                 11011001  此时结果码位为：8，对应数组0~7     （PS:这里的“码位”是笔者自己编的，不要混淆了）  
		*/ 
										  
		i2=num1+num2-1;                   //i2指向进位位 
		if(c[i2]==0){
				i2=i2-1;                  /*判断是否进位：指针先指向进位位，如果进位位为0，说明没有进位，指针前移一位 */
		}  
			
        //循环打印结果。解题思想：参考《计算机组成原理》第70页
	    for(;i2>=0;i2--){
	       	printf("%d",c[i2]);
		}
	}
	return 0;
} 